# Pandas lab exersize 2
We will using Uber Drives 2016 dataset from Kaggle <br>
Load pandas as pd and Uber Drives 2016.csv as `df`

In [43]:
import pandas as pd
df = pd.read_csv('C:\\Users\\Dhananjay\\Desktop\\Python Tutorial CS Dojo\\Uber Drives 2016.csv')
df=df.iloc[:-1,:]

### 1. Check the head of the dataframe

In [46]:
df.head()

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

### 2. How many rows and columns are there?

In [47]:
df.shape

(1155, 7)

### 2. Which is the most recurrent `start city`?

In [48]:
df['START*'].value_counts().head(1)

Cary    201
Name: START*, dtype: int64

### 2. What is the average `miles`?

In [49]:
df['MILES*'].agg('mean')

10.566839826839812

### 3. What is the longest distance `miles`?

In [63]:
df['MILES*'].agg('max')

310.3

### 4. How many trips has distance greater than 10 miles?

In [53]:
df.loc[df['MILES*']>10, 'MILES*'].count()

315

### 5. How many trips has start city as `New York`?

In [ ]:
df[df['START*']=='New York'].count()

### 6. Display the records which has start city as `New York` and miles are greater than `13` miles?

In [64]:
df.loc[(df['START*']=='New York') & (df['MILES*']>13)]

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
22,1/12/2016 16:02,1/12/2016 17:00,Business,New York,Queens County,15.1,Meeting
423,6/10/2016 15:19,6/10/2016 16:28,Business,New York,Jamaica,16.3,Meeting

### 7. Calculate avg miles for each start city?

In [67]:
df.groupby('START*')['MILES*'].agg('mean')

START*
Agnew                           2.775000
Almond                         15.200000
Apex                            5.341176
Arabi                          17.000000
Arlington                       4.900000
Arlington Park at Amberly       1.300000
Asheville                     143.850000
Austin                        136.000000
Banner Elk                     12.375000
Bellevue                       12.900000
Berkeley                       14.375000
Boone                         102.000000
Briar Meadow                    9.600000
Bryson City                    20.820000
Burtrose                        4.800000
CBD                             3.850000
Capitol One                     9.450000
Cary                            8.911940
Central                         1.950000
Chalmette                       1.100000
Chapel Hill                    20.150000
Chessington                     3.350000
College Avenue                  2.600000
Colombo                         5.100000
Columbia Heights                1.500000
Congress Ave District           0.800000
Connecticut Avenue              1.300000
Convention Center District      2.000000
Cory                            3.900000
Couples Glen                   16.950000
                                 ...
Southside                       1.825000
St Thomas                       1.800000
Stonewater                      3.000000
Storyville                      1.550000
Sugar Land                     35.100000
Summerwinds                     8.700000
Sunnyside                       0.700000
Sunnyvale                      17.600000
Tanglewood                      6.225000
Tenderloin                      1.200000
The Drag                        3.728571
Topton                         35.250000
Townes at Everett Crossing      3.300000
Tribeca                         0.900000
University District             5.000000
Unknown Location               13.354730
Wake Co.                        1.800000
Wake Forest                    31.900000
Washington                      6.600000
Washington Avenue               6.200000
Waverly Place                   5.825000
Wayne Ridge                     8.000000
West Berkeley                   3.620000
West End                        2.000000
West Palm Beach                 5.700000
West University                 2.200000
Weston                          4.000000
Westpark Place                  2.182353
Whitebridge                     4.020588
Winston Salem                 133.600000
Name: MILES*, Length: 177, dtype: float64